app/controllers/favourites_controller.rb

	def create
		@item_ids = params[:item_ids].split(",")
		@quantitys = params[:quantitys].split(",")
		if @item_ids.present?
			i = 0
			@item_ids.each do |item_id|
				@favourite = Favourite.new
				@favourite.name = params[:name]
				@favourite.item_id = item_id
				@favourite.quantity = @quantitys[i]
				@favourite.save
---
INSERT INTO `favourites` (`created_at`, `item_id`, `name`, `quantity`, `updated_at`) VALUES ('2013-08-22 06:46:27', 1, 'Ramans', 10, '2013-08-22 06:46:27')

	def index
		@favourite = Favourite.all
---
SELECT `favourites`.* FROM `favourites`