app/controllers/menus_controller.rb

	def create
		@menu = Menu.new(params[:menu])
		if @menu.save
---
INSERT INTO `menus` (`created_at`, `description`, `image_content_type`, `image_file_name`, `image_file_size`, `item_type`, `itemtype`, `name`, `price`, `title`, `updated_at`) VALUES ('2013-08-17 06:16:56', 'vvvb11', 'application/octet-stream', 'new_file', 3456, 'nnn', NULL, 'fff', 66, 'v v', '2013-08-17 06:16:56')

	def index
		@menus = Menu.all
---
SELECT `menus`.* FROM `menus`

	def show
		@menu = Menu.find_by_id(params[:id])
---
SELECT `menus`.* FROM `menus` WHERE `menus`.`id` = 1 LIMIT 1

	def edit
		@menu = Menu.find(params[:id])
---
SELECT `menus`.* FROM `menus` WHERE `menus`.`id` = 2 LIMIT 1

	def destroy
		@menu = Menu.find(params[:id])
		@menu.destroy
---
SELECT `menus`.* FROM `menus` WHERE `menus`.`id` = 4 LIMIT 1
DELETE FROM `menus` WHERE `menus`.`id` = 4

   def display
   	   @menus = Menu.all(:select => "item_type").uniq
---
SELECT item_type FROM `menus`

    def list
   	 	@menus = Menu.where(:item_type => params[:item_type])
---
SELECT `menus`.* FROM `menus` WHERE `menus`.`item_type` = 'hghhhvhvhyhy' LIMIT 1

   	def selected_list
   		if request.get?
   			@item_ids = params[:item_ids]
   			@quantitys = params[:quantitys]
   		else
   			@item_ids = params[:item_ids]
   			@quantitys = params[:quantitys]
   			@menu = Menu.find(@item_ids[0])
---
SELECT `menus`.* FROM `menus` WHERE `menus`.`id` = 1 LIMIT 1