app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `password_hash`, `password_salt`, `updated_at`) VALUES ('2013-08-06 10:19:24', 'ffhfhf', NULL, NULL, '2013-08-06 10:19:24')